Diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//считаю количество дней отпуска, для подсветки строки
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		Строка.КоличествоДнейОтпуска = (Строка.ДатаОкончания - Строка.ДатаНачала) / 86400;
	КонецЦикла;

КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников
&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	
	//считаю количество дней отпуска при изменении текущей строки
	ТекущаяСтрока = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	ТекущаяСтрока.КоличествоДнейОтпуска = (ТекущаяСтрока.ДатаОкончания - ТекущаяСтрока.ДатаНачала) / 86400;

КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура АнализГрафика(Команда)
	
	//выгружаем данные табличной части в таблицу значений, помещаем во временно хранилище
	
	ПараметрыОткрытия = ДанныеФормы();
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыОткрытия, ТекущийЭлемент);
	
	//далее пробовал работы с формой
	
	//ФормаВыборка = ПолучитьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика");

		
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ДанныеФормы()  //не использую этот метод
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
		|ГДЕ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ТаблицаЗначений = РезультатЗапроса.Выгрузить();

	
	//ДанныеФормы = РеквизитФормыВЗначение("Объект");
	
	//ДанныеФормы1 = Новый ХранилищеЗначения(ДанныеФормы);
	
	//Форма = ПоместитьВоВременноеХранилище(ДанныеФормы1);
	
	//ДвоичныеДанные = Новый ДвоичныеДанные(ДанныеФормы);
	
	//ХранилищеЗначенийФормы = Новый ХранилищеЗначения(ДанныеФормы);
	
	//АдресДанныеФормы = ПоместитьВоВременноеХранилище(ХранилищеЗначенийФормы);
		
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЗначениеПараметра", ТаблицаЗначений);
	
	Возврат ПараметрыОткрытия;

КонецФункции
#КонецОбласти
